app/views/messages/index.html.erb

            <% end %>
            <% if message.replies.length > 5 %>
---
SELECT "replies".* FROM "replies" WHERE "replies"."message_id" = 13