app/views/replies/index.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."message_id" = 13
---
  <div class="messageBox">
    <% @message.replies.each do |reply| %>