app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO "messages" ("answer", "challenge_question", "content", "created_at", "score", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["answer", ""], ["challenge_question", ""], ["content", ""], ["created_at", Mon, 08 Oct 2012 11:11:49 UTC +00:00], ["score", 0], ["title", ""], ["updated_at", Mon, 08 Oct 2012 11:11:49 UTC +00:00]]
---
  def create
    @message = Message.new(params[:message])
    @message.score = 0
    @message.content = @message.content + " FML!"


    respond_to do |format|
      if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "5"]]
---
  def update
    @message = Message.find(params[:id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]
SELECT "messages".* FROM "messages"
---
  def destroy
    @message = Message.find(params[:id])
    respond_to do |format|
      if params[:attempt].eql?(@message.answer)
        @message.destroy
        @messages = Message.all

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "12"]]
---
  def reply
    @message = Message.find(params[:id])