app/controllers/replies_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "12"]]
---
  def index
    @message = Message.find(params[:message_id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "13"]]
INSERT INTO "replies" ("content", "created_at", "message_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dsf"], ["created_at", Wed, 10 Oct 2012 16:56:02 UTC +00:00], ["message_id", 13], ["updated_at", Wed, 10 Oct 2012 16:56:02 UTC +00:00]]
SELECT "messages".* FROM "messages"
---
  def create
    @message = Message.find(params[:message_id])
    @reply = @message.replies.create(:content => params[:attempt], :message_id => @message.id)
    respond_to do |format|
      if @reply.save
        @messages = Message.all